src/testing/performance-test/test-case2/32gb/siege-100-users-cp.txt
[alert] Zip encoding disabled; siege requires zlib support to enable it
[error] CONFIG conflict: selected time and repetition based testing
defaulting to time-based testing: 120 seconds
** SIEGE 4.0.2
** Preparing 100 concurrent users for battle.
The server is now under siege...[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com


Lifting the server siege...siege aborted due to excessive socket failure; you
can change the failure threshold in $HOME/.siegerc

Transactions:		         296 hits
Availability:		       21.04 %
Elapsed time:		      119.97 secs
Data transferred:	        0.65 MB
Response time:		        7.09 secs
Transaction rate:	        2.47 trans/sec
Throughput:		        0.01 MB/sec
Concurrency:		       17.50
Successful transactions:        1164
Failed transactions:	        1111
Longest transaction:	       78.93
Shortest transaction:	        0.00
 
Aborted