src/testing/performance-test/test-case2/32gb/siege-200-users-cp.txt
[alert] Zip encoding disabled; siege requires zlib support to enable it
[error] CONFIG conflict: selected time and repetition based testing
defaulting to time-based testing: 120 seconds
** SIEGE 4.0.2
** Preparing 200 concurrent users for battle.
The server is now under siege...[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com

[error] Host not found: fonts.googleapis.com


Lifting the server siege...siege aborted due to excessive socket failure; you
can change the failure threshold in $HOME/.siegerc

Transactions:		         417 hits
Availability:		       26.29 %
Elapsed time:		      119.97 secs
Data transferred:	        0.89 MB
Response time:		        6.19 secs
Transaction rate:	        3.48 trans/sec
Throughput:		        0.01 MB/sec
Concurrency:		       21.51
Successful transactions:        1225
Failed transactions:	        1169
Longest transaction:	       64.16
Shortest transaction:	        0.00
 
Segmentation fault